

# read design 
read_verilog Divby2.v
read_verilog FreqDiv.v

# elaborate design hierarchy
hierarchy -check -top FreqDiv

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
#techmap; opt

# mapping flip-flops to mycells.lib
#dfflibmap -liberty osu018_stdcells.lib

# mapping logic to library example: osu018_stdcells.lib
#abc -liberty osu018_stdcells.lib

# cleanup
#clean

# write synthesized design
#write_verilog synth.v

show Divby2

